akkdong/2ndDisplay/test/BoardTest/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# PSRAM: 32MB HEX mode, 200MHz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# Parition Table
CONFIG_PARTITION_TABLE_OFFSET=0x10000

# Maximum Supported ESP32-P4 Revision (Rev v1.99)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
#CONFIG_ESP32P4_REV_MIN_FULL=100
#CONFIG_ESP_REV_MIN_FULL=100
#CONFIG_ESP32P4_REV_MAX_FULL=199
#CONFIG_ESP_REV_MAX_FULL=199

# USB Serial/JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

#
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

#
CONFIG_ESP_HOSTED=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y

# WiFi Remote buffer config (needed by WIFI_INIT_CONFIG_DEFAULT)
#CONFIG_WIFI_RMT_STA_CONNECT_TIMEOUT_MS=10000
#CONFIG_WIFI_RMT_TX_BUFFER_NUM=16
#CONFIG_WIFI_RMT_RX_MGMT_BUF_NUM=5
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=10
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_WIFI_RMT_TX_BUFFER_TYPE=1
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=32
CONFIG_WIFI_RMT_DYNAMIC_RX_MGMT_BUF=32
CONFIG_WIFI_RMT_ESPNOW_MAX_ENCRYPT_NUM=0
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_VTASKLIST_INCLUDE_COREID=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y


#CONFIG_IDF_EXPERIMENTAL_FEATURES=y
#CONFIG_CODEC_I2C_BACKWARD_COMPATIBLE=n
